html/Tools/git.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-12-30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>VCS: Git</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">VCS: Git</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9f45d3c">1. VCS (版本控制系统)</a></li>
<li><a href="#org0506820">2. 基本使用</a>
<ul>
<li><a href="#org3b2d4d6">2.1. 基本配置</a></li>
<li><a href="#org718388c">2.2. 仓库创建 (repository)</a></li>
<li><a href="#org1409d10">2.3. 版本的添加</a></li>
<li><a href="#org1c4beef">2.4. 分支的管理</a></li>
<li><a href="#orgbbf5d10">2.5. 其他</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-org9f45d3c" class="outline-2">
<h2 id="org9f45d3c"><span class="section-number-2">1</span> VCS (版本控制系统)</h2>
<div class="outline-text-2" id="text-1">
<p>
分类:
</p>
<ul class="org-ul">
<li>集中式 (CVS - SVN)</li>
<li>分布式 (Git)</li>
</ul>

<p>
问题:
</p>
<ul class="org-ul">
<li>两种有啥区别？</li>
<li>请分别叙述两种的优点和缺点。</li>
</ul>

<p>
Git 起源:
</p>
<ul class="org-ul">
<li>Linus/Linux</li>
</ul>
</div>
</section>

<section id="outline-container-org0506820" class="outline-2">
<h2 id="org0506820"><span class="section-number-2">2</span> 基本使用</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3b2d4d6" class="outline-3">
<h3 id="org3b2d4d6"><span class="section-number-3">2.1</span> 基本配置</h3>
<div class="outline-text-3" id="text-2-1">
<p>
下载完，第一件事，就是打开 git-bash，然后执行如下命令。
</p>

<p>
这将会配置个人的信息（可以随便填，最好写真的）:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">&#27880;&#24847;&#65292;&#35201;&#21152; --global&#65292;&#37027;&#20040;&#23558;&#20250;&#25226;&#20462;&#25913;&#30340;&#20449;&#24687;&#20889;&#20837;&#21040; $HOME/.gitconfig</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#22914;&#26524;&#19981;&#21152; --global&#65292;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20250;&#25991;&#20214;&#22841;&#25152;&#22312;&#39033;&#30446;&#30340;&#37197;&#32622;&#25991;&#20214; /e/myblog/.git/config</span>
git config --global user.name <span style="color: #8b2252;">"xxx"</span>
git config --global user.email <span style="color: #8b2252;">"xxx@yyy.com"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org718388c" class="outline-3">
<h3 id="org718388c"><span class="section-number-3">2.2</span> 仓库创建 (repository)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
将一个文件夹转换为仓库:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">&#23558;&#20250;&#22312;&#25991;&#20214;&#22841;&#19979;&#38754;&#29983;&#25104;&#19968;&#20010; .git &#38544;&#34255;&#25991;&#20214;&#22841;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#36825;&#26159;&#19968;&#20010;&#29992;&#26469;&#35760;&#24405;&#25152;&#26377;&#29256;&#26412;&#30340;&#26412;&#22320;&#25968;&#25454;&#24211;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#22914;&#26524;&#23558;&#20854;&#21024;&#38500;&#65292;&#37027;&#20040;&#24403;&#21069;&#25991;&#20214;&#22841;&#23601;&#19981;&#22312;&#29256;&#26412;&#25511;&#21046;&#19979;&#20102;</span>
git init
</pre>
</div>

<p>
从一个已存的仓库克隆一个仓库:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">git clone &#22320;&#22336;</span>
git clone /e/kaoshi
git clone https://github.com/yaollllllsan/aaa.git
git clone git@github.com:yaollllllsan/aaa.git

git clone /e/kaoshi kaoshishaa <span style="color: #b22222;"># </span><span style="color: #b22222;">&#20811;&#38534;&#21040;&#26412;&#25991;&#20214;&#22841;&#21518;&#65292;&#26356;&#21517;&#20026; kaoshishaa</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1409d10" class="outline-3">
<h3 id="org1409d10"><span class="section-number-3">2.3</span> 版本的添加</h3>
<div class="outline-text-3" id="text-2-3">
<p>
首先，在文件夹下面修改若干文件。
</p>

<p>
然后，执行如下命令，将其记录入版本库:
</p>
<div class="org-src-container">
<pre class="src src-sh">git add &lt;&#26576;&#20010;&#25991;&#20214;&#30340;&#21517;&#23383;&gt;
git add aaa/*
git add .

git commit -m <span style="color: #8b2252;">"&#27880;&#37322;"</span>
git commit --message <span style="color: #8b2252;">"&#27880;&#37322;"</span>
git commit

git log <span style="color: #b22222;"># </span><span style="color: #b22222;">&#26597;&#30475;&#26085;&#24535;</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">&#27880;&#24847;&#65292;&#20351;&#29992; git status &#21487;&#20197;&#38543;&#26102;&#26597;&#30475;&#24403;&#21069;&#20179;&#24211;&#30340;&#29366;&#24577;</span>
git status
</pre>
</div>

<p>
VI 的基本使用:
</p>
<ul class="org-ul">
<li>普通模式 (默认):
<ul class="org-ul">
<li>hjkl 分别对应左、下、上、右</li>
<li>^ 都表示移动光标到行首，$ 表示移动到行位</li>
<li>使用 / 或 ? 表示搜索，使用 n 或 N 表示下一个</li>
<li>x 表示删除当前的字符</li>
<li>d 表示删除的前缀, dw/dd, y 表示复制，p 表示将删除的东西粘贴</li>
<li>c 表示替换, cw 表示替换当前单词，cc 表示本行</li>
<li>使用 u 来表示撤销</li>
<li>使用 i 切换到编辑模式，a/o/A/O/I 都是切换到编辑模式</li>
<li>使用 v 进入选择模式</li>
<li>使用 : 进行命令的输入, :w 保存, :q 退出, :wq 保存并退出, :q! 强制退出</li>
</ul></li>
<li>其他模式:
<ul class="org-ul">
<li>ESC 切换到普通模式</li>
</ul></li>
</ul>

<p>
在 git 下面 vi 常用指南:
</p>
<ul class="org-ul">
<li>使用 hjkl 进行光标的移动</li>
<li>使用 i 进入编辑模式，然后输入自己该输入的东西</li>
<li>使用 esc 切换回普通模式</li>
<li>使用 :wq 保存并退出</li>
</ul>

<p>
切换到其他编辑器:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">export</span> <span style="color: #a0522d;">EDITOR</span>=notepad <span style="color: #b22222;"># </span><span style="color: #b22222;">&#20320;&#20063;&#21487;&#20197;&#23558;&#27492;&#21477;&#28155;&#21152;&#21040; $HOME/.bashrc &#19979;&#38754;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c4beef" class="outline-3">
<h3 id="org1c4beef"><span class="section-number-3">2.4</span> 分支的管理</h3>
<div class="outline-text-3" id="text-2-4">
<p>
基本管理：
</p>
<div class="org-src-container">
<pre class="src src-sh">git branch          <span style="color: #b22222;"># </span><span style="color: #b22222;">&#26597;&#30475;&#20998;&#25903;</span>
git branch xxx      <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21019;&#24314;&#19968;&#20010;&#21517;&#20026; xxx &#30340;&#20998;&#25903;</span>
git branch xxx dede <span style="color: #b22222;"># </span><span style="color: #b22222;">&#20174;&#22320;&#22336; dede &#22788;&#21019;&#24314;&#19968;&#20010;&#21517;&#20026; xxx &#30340;&#20998;&#25903;</span>

git checkout xxx    <span style="color: #b22222;"># </span><span style="color: #b22222;">&#20999;&#25442;&#21040;&#20998;&#25903; xxx</span>
git checkout -b yyy <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21019;&#24314;&#20998;&#25903; yyy &#24182;&#20999;&#25442;&#21040; yyy &#20998;&#25903;</span>

git branch -D xxx   <span style="color: #b22222;"># </span><span style="color: #b22222;">&#21024;&#38500; xxx &#20998;&#25903;</span>
</pre>
</div>

<p>
分支合并:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">&#39318;&#20808;&#65292;&#20999;&#25442;&#21040;&#26576;&#20010;&#20998;&#25903;</span>
git checkout master

<span style="color: #b22222;"># </span><span style="color: #b22222;">&#20854;&#27425;&#65292;&#23558;&#30446;&#26631;&#20998;&#25903;&#30340;&#20462;&#25913;&#21512;&#24182;&#21040;&#24403;&#21069;&#20998;&#25903;</span>
git merge xxx

<span style="color: #b22222;"># </span><span style="color: #b22222;">&#20998;&#25903;&#30340;&#21512;&#24182;&#65292;&#20998;&#19977;&#31181;&#31574;&#30053;:</span>
<span style="color: #b22222;">## </span><span style="color: #b22222;">1. &#22914;&#26524;&#20174;&#24320;&#21449;&#30340;&#22320;&#26041;&#31639;&#36215;&#65292;&#24403;&#21069;&#20998;&#25903;&#27809;&#26377;&#20570;&#36807;&#20462;&#25913;&#65292;&#37027;&#20040; fast-forward</span>
<span style="color: #b22222;">## </span><span style="color: #b22222;">2. &#22914;&#26524;&#20174;&#24320;&#21449;&#30340;&#22320;&#26041;&#31639;&#36215;&#65292;&#24403;&#21069;&#20998;&#25903;&#20063;&#20570;&#36807;&#20462;&#25913;&#65292;&#19988;&#20004;&#20010;&#20998;&#25903;&#27809;&#26377;&#20914;&#31361;&#65292;&#20250;&#33258;&#21160;&#21512;&#24182;</span>
<span style="color: #b22222;">## </span><span style="color: #b22222;">3. &#21542;&#21017;&#65292;&#20250;&#21512;&#24182;&#22833;&#36133;&#65292;&#24182;&#22312;&#23384;&#22312;&#20914;&#31361;&#30340;&#25991;&#20214;&#20013;&#22686;&#21152;&#30456;&#20851;&#26631;&#24535;&#12290;&#21518;&#32493;&#38656;&#35201;&#20320;&#25163;&#21160;&#35299;&#20915;&#20914;&#31361;</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">&#21478;&#22806;&#65292;&#38500;&#20102; git merge&#65292;&#36824;&#21487;&#20197;&#20351;&#29992; git rebase &#36827;&#34892;&#21512;&#24182;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#20248;&#28857;&#26159;&#65292;&#19981;&#20250;&#39069;&#22806;&#22686;&#21152;&#25552;&#20132;&#35760;&#24405;&#65292;&#27905;&#30294;&#32773;&#30340;&#31119;&#38899;</span>
git checkout master
git rebase xxx
</pre>
</div>

<p>
远程分支:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">&#40664;&#35748;&#30340; pull/push &#22320;&#22336;: /e/workspace</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#40664;&#35748;&#30340; from:to &#24403;&#21069;&#20998;&#25903;&#26159; xxx&#65292;&#25152;&#20197;&#21487;&#20197;&#20889;&#20986;&#22914;&#19979;&#19977;&#31181;</span>

git pull /e/workspace/bbb xxx:xxx
git pull /e/workspace/bbb xxx
git pull /e/workspace/bbb
git pull

git push origin master:xxx
git push origin
git push

<span style="color: #b22222;"># </span><span style="color: #b22222;">origin &#26159;&#40664;&#35748;&#36828;&#31243;&#20179;&#24211;&#30340;&#21035;&#21517;&#65292;&#26159;&#20026;&#20102;&#31616;&#21270;&#20351;&#29992;&#37319;&#21462;&#30340;&#31574;&#30053;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#20320;&#21487;&#20197;&#36890;&#36807; git remote &#36827;&#34892;&#26597;&#30475;&#65292;&#25110;&#36827;&#34892;&#20462;&#25913;</span>
git remote -v <span style="color: #b22222;"># </span><span style="color: #b22222;">&#26597;&#30475;&#36828;&#31243;&#22320;&#22336;&#30340;&#21035;&#21517;</span>
git remote add <span style="color: #707183;">[</span>origin<span style="color: #707183;">]</span> /e/workspace/bbb
git remote set-url <span style="color: #707183;">[</span>origin<span style="color: #707183;">]</span> https://github.com/yaollllllsan/ddd
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbf5d10" class="outline-3">
<h3 id="orgbbf5d10"><span class="section-number-3">2.5</span> 其他</h3>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2020-12-30</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
